# encoding: utf-8
# language: ru

Функционал: Расчет возраста в месяцах
	Как кадровик
	Хочу получать возраст сотрудника в месяцах
	Чтобы не задерживаться на работе

Сценарий: расчет возраста в месяцах сотрудника с датой рождения 12.06.1990
	Допустим дата рождения сотрудника 12.06.1990
	И сегодня 20.08.2016
	Тогда возраст в месяцах 314

Сценарий: расчет возраста в месяцах сотрудника с датой рождения 26.04.1986
	Допустим дата рождения сотрудника 26.04.1986
	И сегодня 20.08.2016
	Тогда возраст в месяцах 314
