//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаРожденияСотрудника(Парам01)","ДатаРожденияСотрудника","Допустим дата рождения сотрудника 12.06.1990");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"Сегодня(Парам01)","Сегодня","И сегодня 20.08.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастВМесяцах(Парам01)","ВозрастВМесяцах","Тогда возраст в месяцах 314");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим дата рождения сотрудника 12.06.1990
//@ДатаРожденияСотрудника(Парам01)
Процедура ДатаРожденияСотрудника(ДатаРожденияСотрудника) Экспорт
	//Ванесса.ПосмотретьЗначение(ДатаРожденияСотрудника,Истина);
	Контекст.Вставить("ДатаРожденияСотрудника", ДатаРожденияСотрудника);
КонецПроцедуры

&НаКлиенте
//И сегодня 20.08.2016
//@Сегодня(Парам01)
Процедура Сегодня(Сегодня) Экспорт
	//Ванесса.ПосмотретьЗначение(Сегодня,Истина);
	Контекст.Вставить("Сегодня", Сегодня);
КонецПроцедуры

&НаКлиенте

//Тогда возраст в месяцах 314
//@ВозрастВМесяцах(Парам01)
Процедура ВозрастВМесяцах(ВозрастВМесяцах) Экспорт
	//Ванесса.ПосмотретьЗначение(ВозрастВМесяцах,Истина);
	Если НЕ ВозрастВМесяцах = РаботаСДатами.ПолучитьВозрастВМесяцах(Контекст.ДатаРожденияСотрудника, Контекст.Сегодня) Тогда
	
		ВызватьИсключение "Неудача при расчете возвраста!";
	
	КонецЕсли;
КонецПроцедуры

//окончание текста модуля